<?php
//[[13, 17], OP2-16, OP2-20
// [19, 31, 51], OP2-22, OP2-34, OP2-56
// [66, 67, 68, 70, 72, 76, 79, 80, 91], N27-02, N27-03, N27-04, N27-06, N27-08, N27-12, N27-15, N27-16, N27-27
// [13, 14, 17, 18, 19, 21, 25, 29, 31, 33, 51, 55, 58], OP2-16, OP2-17, OP2-20, OP2-21, OP2-22, OP2-24, OP2-28, OP2-32, OP2-34, OP2-36, OP2-56, OP2-60, OP2-63
// [7, 28, 51, 67, 72], OP2-09, OP2-31, OP2-56, N27-03, N27-08
// [26, 46, 77, 82, 88, 89], OP2-29, OP2-50, N27-13, N27-18, N27-24, N27-25
// [80], N27-16
// [35, 43], OP2-38, OP2-46
// [0, 1, 12, 45, 47, 49, 50, 52], OP2-02, OP2-03, OP2-15, OP2-49, OP2-52, OP2-54, OP2-55, OP2-57
// [65, 119, 120, 121],  N27-01, N26-01, N26-02, N26-03
// [14, 23, 25, 26, 28, 35, 43, 46, 72, 77, 88, 89, 123], OP2-17, OP2-26, OP2-28, OP2-29, OP2-31, OP2-38, OP2-46, OP2-50, N27-08, N27-13, N27-24, N27-25, N26-05
// [4, 5, 6, 10, 11, 13, 20, 36, 37, 80, 82, 84, 97]] OP2-06, OP2-07, OP2-08, OP2-13, OP2-14, OP2-16, OP2-23, OP2-39, OP2-40, N27-16, N27-18, N27-20, N27-33

$codes = ['OP2-16', 'OP2-20'];
$interpretation = ['uglevod_plus'=>'Повышение показателей отражает  активацию процессов анаэробного гликолиза для энергообеспечения клетки',
                   'uglevod-minus'=>'Понижение показателей отражает истощение процессов гликолиза, хронический  энергодефицит'];


// OP2-16, OP2-20, N27-02, N27-03, N27-04, N27-06, N27-08, N27-12, N27-15, N27-16, N27-27, N27-01, N26-01, N26-02, N26-03 (upper)

//insert into interpretation values(0, '', ''),(0, '', '')
//insert into rules values('','',''), ('','','')